config.org
*** DONE [#B] Define aliases
#+begin_src emacs-lisp :tangle yes
(set-eshell-alias!
  ;; C-x [0123]
  "0" "delete-window"
  "1" "delete-other-windows"
  "2" "split-window-below"
  "3" "split-window-right"

  ;; find-file
  "e"  "find-file $1"
  "4e" "find-file-other-window $1"
  "5e" "find-file-other-frame $1"

  ;; find-file-read-only
  "r"  "find-file-read-only $1"
  "4r" "find-file-read-only-other-window $1"
  "5r" "find-file-read-only-other-frame $1"

  ;; view-file
  "v"  "view-file $1"
  "4v" "view-file-other-window"
  "5v" "view-file-other-frame"

  ;; eww-open-file
  "w" "eww-open-file $1"

  ;; shell commands
  "git" "TERM=eterm-color git --no-pager -c color.ui=always -c interactive.singleKey=false $*"
  "f"   "cd $1 && ls")
#+end_src

*** KILL [#B] Fix ANSI escape codes
:LOGBOOK:
- Note taken on [2021-06-07 Mon 16:19] \\
  This resolved itself after an update.
:END:
Last two lines from ~doom doctor~:
#+begin_example
[33mThere are 4 warnings![0m
[32m✓ Finished in 7.4969s[0m
#+end_example

You can also try ~rg~ or ~fd~ somewhere in =~/.config/emacs= and you'll
eventually see the escape codes instead of colors being output. The only
workaround I know of now is to use =vterm= instead of =eshell=.

*** TODO [#B] Export ~$EDITOR~ to =eshell=
Unlike with =vterm=, we currently do not export ~$EDITOR~ to =eshell=. This is
to avoid a dangerous situation in which =C-c C-k= not only returns an error code
to =eshell=, it forcefully clears the file on disk.

*** TODO [#B] Fix terminal type
Sometimes ~git~ will spit the following:
#+begin_example
tput: unknown terminal "eterm-color"
#+end_example

** vterm [2/3]
*** DONE [#B] Export ~$EDITOR~ to =vterm=
#+begin_src emacs-lisp :tangle yes
(add-hook! vterm-mode #'with-editor-export-editor)
#+end_src

*** DONE [#B] Let =C-j= and =<M-backspace>= pass through in Evil insert state
#+begin_src emacs-lisp :tangle yes
(after! evil-collection-vterm
  (dolist (key '("C-j" "<M-backspace>"))
    (evil-collection-define-key 'insert 'vterm-mode-map
      (kbd key) 'vterm--self-insert)))
#+end_src

*** TODO [#C] Prevent ~git-graph~ cutoff
The last character ("o" in this case) gets hidden:
#+begin_example
$ git graph
,* 65a8a6b6da9176bea78eb78c604120714207bcc5 Initial commit  eeowaa   3 weeks ag
#+end_example

I say "hidden" instead of "truncated" because if you kill the line and yank it
into another buffer, you can see the "o". *Note that this is only a problem in
GUI Emacs, not terminal Emacs*.

* :checkers
** syntax [1/1]
*** DONE [#B] Disable flycheck in Emacs Lisp config files
#+begin_src emacs-lisp :tangle yes
(mapc (lambda (config-file-dir)
        (add-to-list '+emacs-lisp-disable-flycheck-in-dirs config-file-dir))
      ;; Unique directory components of canonical config file paths
      (delete-dups
       (mapcar (lambda (config-file)
                 (file-name-directory (file-chase-links config-file)))
               ;; Config file paths in canonical config directories
               (mapcan (lambda (config-dir)
                         (directory-files config-dir t "\\.el"))
                       (list (file-truename doom-emacs-dir)
                             (file-truename doom-private-dir))))))
#+end_src

** spell [1/2]
*** DONE [#A] Prevent ~spell-fu-mode~ from being enabled by default
I like having the option, but I would prefer to enable it manually per buffer.

#+begin_src emacs-lisp :tangle yes
(when (and (featurep! :checkers spell)
           (not (featurep! :checkers spell +flyspell)))
  (remove-hook 'text-mode-hook 'spell-fu-mode))
#+end_src

**** COMMENT My initial stab at this
:LOGBOOK:
- Note taken on [2021-05-28 Fri 15:22] \\
  This was very convoluted and unnecessary, but I learned a lot during this
  process, so I want to save my work for future reference.
:END:
Unfortunately, ~use-package-hook!~ cannot be used to remove ~spell-fu-mode~ from
~text-mode-hook~ as set in the ~:hook~ section of the ~use-package!~ declaration
for =spell-fu= in the =checkers/spell= Doom module. (See [[https://emacs.stackexchange.com/questions/64395/how-to-override-the-hook-section-of-a-use-package-declaration][this post on Emacs
StackExchange]] for confirmation.)

Instead, I have decided to advise the ~add-hook~ function to prevent specific
functions from being added to specific hooks.

Note that I tangle to =early-init.el= (which I ~load!~ at the start of
=init.el=) so that the ~add-hook~ advice can be in place before the ~doom!~
block loads the =checkers/spell= module, which is what sets the hook.

: #+begin_src emacs-lisp :tangle early-init.el
#+begin_src emacs-lisp :tangle no
(setq my/hook-deny-list
      '((text-mode-hook . spell-fu-mode)))

(defun my/hook-denied-p (&rest r)
  (let ((hook (car r))
        (func (cadr r)))
    (member (cons hook func) my/hook-deny-list))

(advice-add #'add-hook :before-until #'my/hook-denied-p)
#+end_src

*** TODO [#B] Fix spelling correction
~+spell/correct~ (=z ==) spits the following error:
#+begin_quote
Starting new Ispell process aspell with english dictionary...done
ispell-init-process: Error: /Users/eeowaa/.config/emacs/.local/etc/ispell/english.pws: The language "english" is not known. This is probably because: the file "/usr/local/Cellar/aspell/0.60.8/lib/aspell-0.60/english.dat" can not be opened for reading.
#+end_quote

*UPDATE*: After running the following, it worked for me:
#+begin_src sh :tangle no
rm -rf ~/.config/emacs/.local/etc/ispell
#+end_src

I also ran the following, but I'm not sure if it made a difference:
#+begin_src emacs-lisp :tangle yes
(setq ispell-dictionary "english")
#+end_src

**** TODO Prevent this from happening
I don't know why, but this problem reappears on me.

**** TODO Make spelling corrections match recommendations
The =company= backend that provides spelling recommendations (via =C-SPC=) must
use a different dictionary than the =spell= module that highlights errors and
provides corrections. For example, the word "fluctuant" is highlighted as a
spelling error by the =spell= module but is a completion for "flu" (just type
=C-SPC= in Evil insert state with the cursor positioned after the "u" in "flu").

* :tools
** debugger [0/1]
*** TODO [#A] Fix DAP mode error message
I get this error when I visit a file that invokes ~lsp!~:
#+begin_example
(doom-hook-error lsp!
  (error Recursive load
    ~/.config/emacs/.local/straight/build-28.0.50/dap-mode/dap-mode.el
    ~/.config/emacs/.local/straight/build-28.0.50/dap-mode/dap-mode.el
    ~/.config/emacs/.local/straight/build-28.0.50/dap-mode/dap-mode.el
    ~/.config/emacs/.local/straight/build-28.0.50/dap-mode/dap-mode.el
    ~/.config/emacs/.local/straight/build-28.0.50/dap-mode/dap-mode.el
    ~/.config/emacs/.local/straight/build-28.0.50/lsp-mode/lsp-mode.el))
#+end_example

For now, I might just want to unset ~lsp-enable-dap-auto-configure~ and see if
that prevents errors. Worst case, I could disable =debugger=.

*UPDATE*: Unfortunately I was unable to resolve this quickly and opted to
disable =debugger= for the time being (it's not super-important for me right
now, anyway).

** lookup [0/1]
*** HOLD [#C] Add dictionary and thesaurus backends for =SPC s t/T=
I've done everything that the Doom documentation told me to do, but things
aren't working very well. Just try it out for yourself and see. Might want to
open a PR or two.

** lsp [0/2]
*** TODO [#A] Fix the size of the popup buffer invoked by =M-x lsp=
/Note that ~lsp~ is invoked when you enter a buffer, as well/.

When the frame is too small (e.g. its default size), the first few menu items in
the popup window are cut off, and all you see are options to exclude the file
from the LSP workspace. Unless you know about the other available options, LSP
won't work for you. Unfortunately, resizing the frame does not help.

** magit [1/1]
*** DONE [#C] Configure list of repositories
#+begin_src emacs-lisp :tangle yes
(setq magit-repository-directories
      '(("~/Documents/src" . 2)
        ("~/Documents/ref" . 1)
        ("~/stow-dotfiles" . 1)))
#+end_src

* :os
** macos [1/2]
*** DONE [#A] Remap keys for macOS
#+begin_src emacs-lisp :tangle yes
(when IS-MAC
  (setq ;; Comfortable keys that work most of the time
        mac-command-modifier 'control
        mac-right-command-modifier 'meta

        ;; Workaround for when system keybindings take precedence
        mac-control-modifier 'control
        mac-right-control-modifier 'meta

        ;; For exotic mappings
        mac-option-modifier 'super
        mac-right-option-modifier 'hyper))
#+end_src

*** STRT [#B] Experiment with Keychain as a member of ~auth-sources~
I'm already doing this with =forge=, but I'd like to better document what I'm
doing and how to use Keychain with other Emacs facilities.

* :lang
** markdown [1/2]
:PROPERTIES:
:CATEGORY: doom/markdown
:END:
*** DONE [#B] Improve Markdown readability
+ https://emacs.stackexchange.com/questions/3753/prettify-symbols-mode-character-replacement-regex

| Before      | After |
|-------------+-------|
| \\.         | .     |
| \\(         | (     |
| \\)         | )     |
| \\-         | -     |
| &copy       | ©    |
| <a.*>.*</a> |       |

#+begin_src emacs-lisp :tangle yes
(add-to-list 'font-lock-extra-managed-props 'display)
(font-lock-add-keywords
 'markdown-mode
 '(("\\(\\\\\\)[[().-]" 1 '(face nil display ""))
   ("&copy;" 0 '(face nil display "©"))
   ("<a name=\".*\"></a>" 0 '(face nil display ""))))
#+end_src

*** TODO [#C] Replace =font-lock= hiding with native =markdown-mode= hiding
+ [[file:~/.config/emacs/.local/straight/repos/markdown-mode/markdown-mode.el::defun markdown-toggle-markup-hiding (&optional arg][(defun markdown-toggle-markup-hiding]]
+ [[file:~/.config/emacs/.local/straight/repos/markdown-mode/markdown-mode.el::;;; Markup Hiding =============================================================][;;; Markup Hiding]]

** org [11/26]
:PROPERTIES:
:CATEGORY: doom/org
:COOKIE_DATA: recursive
:END:
*** Agenda [4/7]
**** DONE [#A] Establish agenda file layout
Relevant variables:
+ ~org-directory~
+ ~org-agenda-files~
+ ~org-attach-directory~
+ ~org-mobile-directory~

| Candidates          | Buffer or File             | Headline          | Text              |
|---------------------+----------------------------+-------------------+-------------------|
| Current buffer      |                            | org: =SPC m .=    | global: =SPC s s= |
| Org buffers         | org: =SPC m ,=             | org: =SPC m /=    |                   |
| Agenda files        | org: =SPC u SPC u SPC m ,= | global: =SPC n S= |                   |
| Org directory files | global: =SPC n f=          |                   | global: =SPC n s= |

The following is a prerequisite for my organization:
#+begin_src sh :tangle no
mkdir -p ~/Documents/org && ln -s ~/Documents/org ~/org
#+end_src

#+begin_src emacs-lisp :tangle yes
(setq
      ;; Top-level directory (used by `+default/find-in-notes', etc.)
      org-directory "~/org"

      ;; Directories to search for agenda files
      my/org-directories `("work" "life" ,doom-private-dir)
      org-agenda-files (mapcar (lambda (f)
                                 (if (file-name-absolute-p f) f
                                   (expand-file-name f org-directory)))
                               `("" ,@my/org-directories))

      ;; Only "todo.org" files hold agenda items
      org-agenda-file-regexp "\\`todo.org\\'")
#+end_src

**** DONE [#A] Widen the agenda prefix and indent subtasks
#+begin_src emacs-lisp :tangle yes
(setq org-agenda-prefix-format
      '((agenda  . " %i  %l%-16:c%?-12t% s")
        (todo    . " %i  %l%-16:c")
        (tags    . " %i  %l%-16:c")))
#+end_src

**** DONE [#A] Inherit priority so that subtasks appear under their parents in the agenda
#+begin_src emacs-lisp :tangle yes
(after! org
  (defun my/org-inherited-priority (s)
    (cond
     ;; Priority cookie in this heading
     ((string-match org-priority-regexp s)
      (* 1000 (- org-priority-lowest
                 (org-priority-to-value (match-string 2 s)))))
     ;; No priority cookie, but already at highest level
     ((not (org-up-heading-safe))
      (* 1000 (- org-priority-lowest org-priority-default)))
     ;; Look for the parent's priority
     (t
      (my/org-inherited-priority (org-get-heading)))))
  (setq org-priority-get-priority-function #'my/org-inherited-priority))
#+end_src

**** DONE [#B] Do not display file tags in the agenda
#+begin_src emacs-lisp :tangle yes
(setq org-agenda-hide-tags-regexp "\\`work\\|life\\|doom\\|todo\\'")
#+end_src

