config.org
**** STRT [#A] Insert new headings just how I like them
This is mostly done, but I do not want there to be a blank line after drawers or
scheduling information:

+ [ ] ~^:END:$~
+ [ ] ~^\\(?:DEADLINE\\|SCHEDULED\\):~

#+begin_src emacs-lisp :tangle yes
(after! org
  (setcdr (assoc 'heading org-blank-before-new-entry) nil)
  (defun my/org-insert-heading-spacing ()
    "Surround an Org heading with appropriate whitespace.

This is the general idea:

,* A
,* B
Entry content

,** B.1
,** B.2
:PROPERTIES:...

,** B.3
,* C (intentional blank line in entry)

,* D
"
    ;; Delete all blank lines following the heading
    (delete-blank-lines)
    ;; Set spacing appropriately before the heading
    (save-excursion
      (forward-line -1)
      ;; What immediately precedes the heading line?
      (cond
       ;; Another heading line (or same heading at beginning of buffer) => do nothing
       ((org-at-heading-p) t)
       ;; Blank line => squeeze consecutive blank lines
       ((looking-at-p "[[:blank:]]*$") (delete-blank-lines))
       ;; Non-blank non-heading line => insert a blank line before the heading
       (t (forward-line 1) (newline)))))
  (defun my/org-insert-heading-visibility ()
    "Redisplay the previous Org heading.

I cannot figure out where the visibility state is saved, so I
just perform a complete cycle of `org-cycle'."
    (save-window-excursion
      (save-excursion
        (org-previous-visible-heading 1)
        ;; XXX Doom-specific
        (when evil-mode (evil-normal-state))
        (call-interactively #'org-cycle)
        (call-interactively #'org-cycle))))
  (defun my/org-insert-heading-evil-state ()
    "End up with the cursor in 'insert mode' at the end of the Org heading"
    ;; XXX Doom-specific
    (when evil-mode (evil-org-append-line 1)))
  (add-hook! org-insert-heading #'(my/org-insert-heading-spacing
                                   my/org-insert-heading-visibility
                                   my/org-insert-heading-evil-state)))
#+end_src

**** HOLD [#C] Allow 5 lines of emphasized text
This appears to cause freezes. For now, I'll get by without.

#+begin_src emacs-lisp :tangle no
(after! org
  (setcar (nthcdr 4 org-emphasis-regexp-components) 4))
#+end_src

**** TODO [#C] Use Org speed keys
Just apply your old configuration.

**** TODO [#C] Create headline sorting function
+ Sort by priority, then by by ~TODO~ keyword
+ Reference ~org-sort-entries~

**** TODO [#C] Create integration between embedded ~TODO~ and project =todo.org=
Something like this Atlassian VS Code plugin:
https://support.atlassian.com/bitbucket-cloud/docs/jira-issues-in-vs-code/

+ Embedded ~TODO~ comments:
  + https://github.com/tarsius/hl-todo
  + ~hl-todo-keyword-faces~
  + ~hl-todo-next~, ~hl-todo-previous~, ~hl-todo-occur~
+ Project =todo.org= list:
  + ~org-capture-templates~
  + ~counsel-projectile-org-capture-templates~
  + ~counsel-projectile-org-capture~
+ Integration with Git:
  + https://github.com/alphapapa/magit-todos
  + ~magit-todos-list~

**** TODO [#C] Figure out how to /easily/ insert screenshots into Org buffers
Right now, the best way I know how is to take a screenshot using the macOS
system keybinding (=Cmd-Shift-4=), save it as a file, and then drag and drop the
file itself (from Finder) into an Org buffer via =+dragndrop=. This takes too
long. What about ~org-screenshot-take~?

**** TODO [#C] Ignore surrounding tildes for interactive help functions
Doom's org markup convention is to surround elisp symbols with tildes. However,
this makes it difficult to use commands such as ~counsel-describe-variable~
(=SPC h v=), ~counsel-describe-function~ (=SPC h f=), and ~find-function~
(custom-mapped to =C-h C-f=) for symbols under point.

The current workaround is to select the "object" under point using =v i e= and
then use the corresponding help command. This works well enough, but is an
annoying extra step.

**** TODO [#C] Create method to store Org links from =eshell= buffers
Just store the current working directory.

**** TODO [#C] Fix emoji display in Org column mode
:PROPERTIES:
:COLUMNS: %TODO %ITEM %attentive(👂) %diligent(🚜) %inventive(🔧) %astute(🎯) %curious(🔭) %nurturing(💯) %uncompromising(🎖) %visionary(🌎) %daring(🏈) %frugal(💵) %trustworthy(🤝) %probing(🔎) %assertive(☝) %productive(📦)
:END:
| Icon | Property       | Amazon Leadership Principle        |
|------+----------------+------------------------------------|
| 👂   | attentive      | Customer Obsession                 |
| 🚜   | diligent       | Ownership                          |
| 🔧   | inventive      | Invent and Simplify                |
| 🎯   | astute         | Are Right, A Lot                   |
| 🔭   | curious        | Learn and Be Curious               |
| 💯   | nurturing      | Hire and Develop the Best          |
| 🎖   | uncompromising | Insist on the Highest Standards    |
| 🌎   | visionary      | Think Big                          |
| 🏈   | daring         | Bias for Action                    |
| 💵   | frugal         | Frugality                          |
| 🤝   | trustworthy    | Earn Trust                         |
| 🔎   | probing        | Dive Deep                          |
| ☝   | assertive      | Have Backbone; Disagree and Commit |
| 📦   | productive     | Deliver Results                    |

For whatever reason, only the emoji for "uncompromising" and "assertive" are
showing in Org column view when invoked by =C-c C-x C-c= (~org-columns~).
Additionally, the cursor jumps one column to the right when moving to the lines
in the table that contain either of those emoji, somewhat suggesting that they
are one character wider than the others. Unfortunately, when replacing those
"two-character-wide" emoji with alternative "one-character-wide" emoji to
achieve consistent "character width", what happens is that no emoji are
displayed at all.

** python [1/2]
:PROPERTIES:
:CATEGORY: doom/python
:END:
*** DONE [#A] Develop and run a simple "Hello World" program
More than a simple "Hello World":
+ [[file:~/src/life/secret-santa/][Secret Santa project]]
+ [[file:~/Documents/org/life/notes.org::*Developing with interpreted languages][Notes for developing with interpreted languages]]

*** HOLD [#C] Set up debugging
+ Holding until I complete the following: [[*Fix DAP mode error message][Fix DAP mode error message]]

** yaml [5/6]
:PROPERTIES:
:CATEGORY: doom/yaml
:END:
*** DONE [#A] Set the YAML LSP server to RedHat's implementation
+ https://developers.redhat.com/blog/2017/10/18/yaml-language-server-extension-vs-code/

Every time I try to use LSP with ~yamlls~, this is what I get:
: Server yamlls:4133 status:starting exited with status exit. Do you want to restart it? (y or n)

Got it working. See the ~PREREQ~ lines for the =yaml= module in
=$DOOMDIR/init.el=. Could use some cleanup.

*** DONE [#A] Download the schema definitions if we don't have them already
I /think/ this is working. However, I have a note from my "illiterate" config
saying that the implementation of ~lsp-yaml-download-schema-store-db~ is buggy.

#+begin_src emacs-lisp :tangle yes
(after! lsp-yaml
  (let ((f lsp-yaml-schema-store-local-db))
    (unless (file-exists-p f)
      (mkdir (file-name-directory f) t)
      (lsp-yaml-download-schema-store-db))))
#+end_src

*** DONE [#B] Use CloudFormation YAML schema
I use YAML almost entirely for CloudFormation, so I like to use CloudFormation
YAML schema by default. This involves setting ~lsp-yaml-schemas~ appropriately,
but unfortunately the documentation in that regard is quite lacking. I managed
to get it right mostly by running =M-x lsp-yaml-select-buffer-schema= and then
selecting the correct schema ("AWS CloudFormation") through interactive
completion.

#+begin_src emacs-lisp :tangle yes
(setq lsp-yaml-schemas
      '((https://raw\.githubusercontent\.com/awslabs/goformation/v4\.15\.0/schema/cloudformation\.schema\.json
         . ["*.yaml" "*.yml"])))
#+end_src

Other references:
+ https://github.com/redhat-developer/yaml-language-server#using-yamlschemas-settings
+ Help for ~lsp-yaml-schemas~
+ File referenced by ~lsp-yaml-schema-store-local-db~

*** DONE [#B] Disable LSP syntax checking
Honestly, I don't really need syntax checking from RedHat's YAML language server
when ~cfn-lint~ does a better job. In fact, it appears as though there are false
alarms when using LSP syntax checking (and that's not even counting custom
tags).

#+begin_src emacs-lisp :tangle yes
(setq-hook! 'yaml-mode-hook lsp-diagnostic-package :none)
#+end_src

References:
+ https://github.com/emacs-lsp/lsp-mode/issues/1810
+ [[file:~/.config/emacs/modules/lang/yaml/config.el]]

*** DONE [#A] Integrate ~cfn-lint~ with Flycheck
Again, since I'm only really using YAML for CloudFormation (at the moment), I
feel OK about automatically integrating ~cfn-lint~ into Flycheck for all YAML
files. This fills in the diagnostics gap left by RedHat's YAML language
server implementation and corresponding Emacs mode.

#+begin_src emacs-lisp :tangle yes
(after! flycheck
  (flycheck-define-checker cfn-lint
    "A CloudFormation linter using cfn-lint."
    :command ("cfn-lint" "-f" "parseable" source)
    :error-patterns ((warning line-start (file-name) ":" line ":" column
                              ":" (one-or-more digit) ":" (one-or-more digit) ":"
                              (id "W" (one-or-more digit)) ":" (message) line-end)
                     (error line-start (file-name) ":" line ":" column
                            ":" (one-or-more digit) ":" (one-or-more digit) ":"
                            (id "E" (one-or-more digit)) ":" (message) line-end))
    :modes (yaml-mode))
    (add-to-list 'flycheck-checkers 'cfn-lint))
#+end_src

A better way to do this would probably be through a project mode. (Refer to
~+ansible-yaml-mode~ and ~def-project-mode!~ for more info.) However, when I
tried doing this, I had some errors so decided to back out for now.

Reference:
+ https://awk.space/blog/cfn-lint/

*** HOLD [#C] Add custom CloudFormation tags :TESTME:
This is the sort of thing that should probably be set per schema, but again,
since I pretty much only use YAML for CloudFormation, defining custom tags
globally should be OK. Unfortunately, I can't figure out how to get this to
work. The following subtrees explain what I tried doing. Make sure to view the
*Notes* subtree!

**** List of strings
#+begin_src emacs-lisp :tangle no
(setq lsp-yaml-custom-tags
      '("!Equals sequence"
        "!FindInMap sequence"
        "!GetAtt"
        "!GetAZs"
        "!ImportValue"
        "!Join sequence"
        "!Ref"
        "!Select sequence"
        "!Split sequence"
        "!Sub"))
#+end_src
This causes the following error after opening a YAML file:
: Error processing message (wrong-type-argument symbolp "!Equals sequence").

**** Serialized JSON string
#+begin_src emacs-lisp :tangle no
(setq lsp-yaml-custom-tags
      (json-serialize
       ["!Equals sequence"
        "!FindInMap sequence"
        "!GetAtt"
        "!GetAZs"
        "!ImportValue"
        "!Join sequence"
        "!Ref"
        "!Select sequence"
        "!Split sequence"
        "!Sub"]))
#+end_src
Unfortunately, invalid tags do not appear as Flycheck errors, and the following
error occurs when attempting to complete anything in the YAML buffer with
=C-SPC= (~+company/complete~) in Evil insert state:

: Company: An error occurred in auto-begin
: Company: backend company-capf error "Request textDocument/completion failed with message: customTags.filter is not a function" with args (candidates )

**** Notes
Looks like this is a problem stemming from RedHat's YAML LSP server
implementation, and I might be able to get around it by using a
CloudFormation-specific YAML LSP server (at least until I get around to using
Ansible more). Unfortunately, it looks like there is no such integration with
Emacs, but I've gathered some links on how I might be able to perform the
integration myself.

Reference:
+ https://stackoverflow.com/questions/53470329/aws-sam-yaml-template-unknown-tag-ref
+ https://emacs-lsp.github.io/lsp-mode/page/adding-new-language/
+ https://github.com/aws-cloudformation/aws-cfn-lint-visual-studio-code/blob/master/package.json

** javascript [1/2]
:PROPERTIES:
:CATEGORY: doom/ts
:END:
The =lang/javascript= module is what powers TypeScript development. Currently, I
am only using TypeScript -- not vanilla JavaScript -- so the ~:CATEGORY:~
property for this subtree is set to ~doom/ts~.

*** DONE [#B] Use gitignore-mode for .npmignore files
#+begin_src emacs-lisp :tangle yes
(add-to-list 'auto-mode-alist '("\\.npmignore\\'" . gitignore-mode))
#+end_src

*** HOLD [#B] Set up debugging
+ Try ~dap-mode~ https://www.youtube.com/watch?v=0bilcQVSlbM
+ Holding until I complete the following: [[*Fix DAP mode error message][Fix DAP mode error message]]

* :config
** default [6/8]
