config.org
** DONE [#A] Configure native compilation
#+begin_src emacs-lisp :tangle yes
(when (and (featurep 'nativecomp)
           (native-comp-available-p))
  (setq comp-speed 2
        package-native-compile t))
#+end_src

The conditional was taken from ~comp-ensure-native-compiler~, which was /not/
used for two reasons:

1. The =comp= package defines ~comp-ensure-native-compiler~, but I don't know
   when the =comp= package is loaded. However, ~featurep~ and
   ~native-comp-available-p~ are both C constructs.
2. Rather than return ~t~ when native compilation is built-in and available,
   ~comp-ensure-native-compiler~ always returns ~nil~ and just spits an error
   in the negative case.

** DONE [#B] Dedicate windows
#+begin_src emacs-lisp :tangle yes
(defun my/toggle-window-dedicated ()
  "Control whether or not Emacs is allowed to display another
buffer in current window."
  (interactive)
  (message
   (if (let (window (get-buffer-window (current-buffer)))
         (set-window-dedicated-p window (not (window-dedicated-p window))))
       "%s: Can't touch this!"
     "%s is up for grabs.")
   (current-buffer)))

(define-key! evil-window-map
  ;; replaces `+workspace/close-window-or-workspace'
  "d" #'my/toggle-window-dedicated)
#+end_src

** DONE [#C] Keep icons small by default
#+begin_src emacs-lisp :tangle yes
(setq all-the-icons-scale-factor 1.0)
#+end_src

** DONE [#C] Don't prompt about killing running processing when quitting
#+begin_src emacs-lisp :tangle yes
(setq confirm-kill-processes nil)
#+end_src

** DONE [#C] Don't suggest abbreviations for long command names
#+begin_src emacs-lisp :tangle yes
(setq extended-command-suggest-shorter nil)
#+end_src

** DONE [#C] Allow easy input of accented and special characters via =C-\=
#+begin_src emacs-lisp :tangle yes
(setq default-input-method "latin-postfix")
#+end_src

** STRT [#B] Truncate lines by default
This doesn't appear to be working...

#+begin_src emacs-lisp :tangle yes
(setq-default truncate-lines t)
#+end_src

** STRT [#B] Remove =straight= package repos from =projectile=
Unfortunately, the =~/.config/emacs/.local/straight/repos/*= are creeping back
in, so this isn't finished yet.

#+begin_src emacs-lisp :tangle yes
;; REVIEW See if there is a cleaner way to flatten the `mapcan' list result
(after! projectile
  (eval
   `(pushnew!
     projectile-globally-ignored-directories
     ,@(mapcan
        (lambda (f)
          (when (file-directory-p f)
            (list (abbreviate-file-name f))))
        (directory-files (format "%s/.local/straight/repos" doom-emacs-dir)
                                   t "\\`[^.]")))))
#+end_src

** TODO [#B] Always trust file-location and directory-local variables
At least for all files in allowed paths (e.g. my source code).

** TODO [#B] Figure out the autosave and backup situation for Doom Emacs
Compare with my old config and try to match it.

** TODO [#C] Figure out how to use ~projectile-edit-dir-locals~ (=SPC p e=)
https://www.emacswiki.org/emacs/SkeletonMode

** TODO [#C] Replace =C-?= with backspace
We already have =C-r=, so might as well replace this mostly-useless keybinding.

** TODO [#C] Fix ImageMagick display of images
** TODO [#C] Suppress warning for ~Package cl is deprecated~
https://github.com/hlissner/doom-emacs/issues/3372

** DONE [#A] Load custom config if present
#+begin_src emacs-lisp :tangle yes
(load! "custom" doom-private-dir t)
#+end_src
